# Contains Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WireMaterialTypeSet..::..Contains Method
WireMaterialTypeSet Class See Also
---
Tests for the existence of a wire material type within the set.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual bool Contains(
	WireMaterialType item
)
```

Visual Basic
---
```text
Public Overridable Function Contains ( _
	item As WireMaterialType _
) As Boolean
```

Visual C++
---
```text
public:
virtual bool Contains(
	WireMaterialType^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB.Electrical..::..WireMaterialTypeThe wire material type to be searched for.
# ### Return Value
The Contains method returns True if the wire material type is within the set, otherwise False.
# See Also
WireMaterialTypeSet Class
Autodesk.Revit.DB.Electrical Namespace